---
kind: enumMember
id: F:Autodesk.Revit.DB.ViewportPositioning.ViewportCenter
enum: Autodesk.Revit.DB.ViewportPositioning
source: html/ef1bc472-5074-ae92-0d7e-37367c03546b.htm
---
# Autodesk.Revit.DB.ViewportPositioning.ViewportCenter

When swapping to another view, the center of the viewport will be maintained.